file_name = '../../Files/my_text'  # --------------- Назва файла та розташування файла
text_file = open(file_name,'r', encoding='utf-8')#---------- Відкриваємо файл
# 'r' - для читання, 'w' - для запису

txt = text_file.read(2)#------------ Читаємо файл
#------------------------в дужках вказуємо кількість символів, що потрібно прочитати

print('txt:', txt)#---------------------------------------Демонструємо прочитане

text_file.seek(0) # Повертаємось на нульову позицію у файлі

txt=text_file.read(2)
print('txt:', txt)
text_file.seek(0)

txt_2 = text_file.readline() # ---------------------------Зчитуємо цілий рядок
print('txt_2:', txt_2)




