import itertools
#----------------------------- Генератор комбінацій з матеріалів списку
combs = itertools.combinations([1, 2, 3, 4],2)
print(list(combs))
print('-'*30)

#-----------------------------Удосконалений  Генератор комбінацій з матеріалів списку
print(list(itertools.combinations_with_replacement([1, 2, 3, 4],2)))
print('-',30)

#-----------------------------Удосконалений  Генератор комбінацій з матеріалів списку, що змінює порядок
permutations = itertools.permutations([1, 2, 3, 4],2)
print(list(permutations))
print('-'*30)


#--------------------------------------------------- Почергове додавання всіх елементів списку
print(list(itertools.accumulate([1, 2, 3, 4, 5])))
print('-'*30)

#----------------------------------------------------Участь всіх елементів списку у виразі, що переданий у другому параметрі
print(list(itertools.accumulate([1, 2, 3, 4, 5],lambda a, b: a - b)))
print('-'*30)

#---------------------------------------------------- Створення нового списку, у межах - параметр 2 та за правилами - параметр 1
print(list(itertools.filterfalse(lambda x: x % 2, range(10))))
print('-'*30)

