import math

print(math.sqrt(16)) #----------------------Знаходимо корінь квадраний

print(math.pi)

print(math.e)

print(math.ceil(2.1)) #------------------- Округлюємо до більшого цілого числа

print(math.floor(2.1))#------------------- Округлюємо до меншого цілого числа

print(math.dist([1,0,0,],[0,1,0]))

#------------------------------------------------------------------------------
radius = 2
print(math.pi+(radius**2))
print('-'*20)
#------------------------------------------------------------------------------

